
--LOWER: 소문자 반환
SELECT  LOWER('ABCD')

--UPPER: 대문자 반환
SELECT  UPPER('abcd')

/*************************************************************************************/

--LEFT: 왼쪽부터 지정한 수 만큼 문자 반환
SELECT  LEFT('ABCD', 2)

--RIGHT: 오른쪽부터 지정한 수 만큼 문자 반환
SELECT  RIGHT('ABCD', 2)

/*************************************************************************************/

--LEN: 문자수 반환(오른쪽 공백제외)
SELECT  LEN('ABCD')
SELECT  LEN('ABCD ')
SELECT  LEN(' ABCD')

/*************************************************************************************/

--REPLACE: 문자열 중, 지정 문자 변환
SELECT  REPLACE('ABCD', 'A', 'a')

/*************************************************************************************/

--CONCAT: 둘 이상의 문자열 연결
SELECT  CONCAT('AB', 'C', 'D')

/*************************************************************************************/

--LTRIM: 왼쪽 공백 제외 문자 반환
SELECT  LTRIM('  ABCD')

--RTRIM: 오른쪽 공백 제외 문자 반환
SELECT  RTRIM('ABCD  ')

--TRIM: 양쪽 공백 제외 문자 반환
SELECT  TRIM('  ABCD  ')

/*************************************************************************************/

--SUBSTRING: 문자열의 지정 위치 및 길이 만큼 문자 반환
SELECT  SUBSTRING('ABCD', 2, 2)

/*************************************************************************************/

--CHARINDEX: 문자열 중, 지정 문자 위치 반환(지정 문자가 없으면, 0 반환)
SELECT  CHARINDEX('B','ABCD')
SELECT  CHARINDEX('B','ABCD', 3) -- ABCD에서 3부터 검색시작 

/*************************************************************************************/

--SPACE: 공백 추가
SELECT  'A'+SPACE(5)+'B'

/*************************************************************************************/

--STUFF: 
SELECT  STUFF('ABCD', 2, 2, 'xx')
